Catalogs/Договоры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Договоры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОсновнойДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВзаиморасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/Вид.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Вид</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Договоры/Ext/ManagerModule.bsl
Процедура ПечатьWord(МакетДоговора, СсылкаНаОбъект) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры.НомерДоговора КАК НомерДоговора,
		|	Договоры.ДатаДоговора КАК ДатаДоговора,
		|	Договоры.Владелец.Наименование КАК КонтрагентНаименование,
		|	Договоры.Владелец.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
		|	Договоры.Организация.Наименование КАК ОрганизацияНаименование,
		|	Договоры.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	Договоры.Организация.ИНН КАК ОрганизацияИНН,
		|	Договоры.Владелец.ЮридическоеЛицо.ИНН КАК ВладелецЮридическоеЛицоИНН,
		|	Договоры.ВидДоговора КАК ВидДоговора,
		|	Договоры.ВалютаРасчета КАК ВалютаРасчета,
		|	Договоры.ВидВзаиморасчета КАК ВидВзаиморасчета,
		|	Договоры.Владелец.ФизическоеЛицо.ИНН КАК КонтрагентФизическоеЛицоИНН,
		|	Договоры.Владелец.ЮридическоеЛицо.ИНН КАК КонтрагентЮридическоеЛицоИНН,
		|	Договоры.Организация.ФизическоеЛицо.ИНН КАК ОрганизацияФизическоеЛицоИНН,
		|	Договоры.Владелец.ВидКонтрагента КАК КонтрагентВидКонтрагента,
		|	Договоры.Организация.ВидОрганизации КАК ОрганизацияВидОрганизации,
		|	Договоры.Наименование КАК ДоговорНаименование
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|ГДЕ
		|	Договоры.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбъектWord = МакетДоговора.Получить();  
		
		ШаблонWord = ОбъектWord.Application.Documents(1);
		
		ОбъектWord.Bookmarks("ДоговорНаименование").Select();	
		ОбъектWord.Application.Selection.TypeText(Строка(ВыборкаДетальныеЗаписи.ДоговорНаименование)); 
		
		ОбъектWord.Bookmarks("НомерДоговора").Select();	
		ОбъектWord.Application.Selection.TypeText(Строка(ВыборкаДетальныеЗаписи.НомерДоговора)); 
		
		ОбъектWord.Bookmarks("ДатаДоговора").Select();	
		ОбъектWord.Application.Selection.TypeText(Строка(Формат(ВыборкаДетальныеЗаписи.ДатаДоговора,"ДФ=dd.MM.yyyy")));
		
		ОбъектWord.Bookmarks("ОрганизацияНаименованиеПолное").Select();	
		ОбъектWord.Application.Selection.TypeText(Строка(ВыборкаДетальныеЗаписи.ОрганизацияНаименованиеПолное));

		ОбъектWord.Bookmarks("КонтрагентНаименованиеПолное").Select();	
		ОбъектWord.Application.Selection.TypeText(Строка(ВыборкаДетальныеЗаписи.КонтрагентНаименованиеПолное));
		
		ОбъектWord.Bookmarks("ВидДоговора").Select();	
		ОбъектWord.Application.Selection.TypeText(Строка(ВыборкаДетальныеЗаписи.ВидДоговора));
		
		ОбъектWord.Bookmarks("ВалютаРасчета").Select();	
		ОбъектWord.Application.Selection.TypeText(Строка(ВыборкаДетальныеЗаписи.ВалютаРасчета));
		
		ОбъектWord.Bookmarks("ВидВзаиморасчета").Select();	
		ОбъектWord.Application.Selection.TypeText(Строка(ВыборкаДетальныеЗаписи.ВидВзаиморасчета));
		
		ОбъектWord.Bookmarks("ОрганизацияНаименование").Select();	
		ОбъектWord.Application.Selection.TypeText(Строка(ВыборкаДетальныеЗаписи.ОрганизацияНаименование)); 
		
		Если ВыборкаДетальныеЗаписи.ОрганизацияВидОрганизации = Перечисления.Вид.ЮридическоеЛицо Тогда
			ОбъектWord.Bookmarks("ОрганизацияИНН").Select();	
			ОбъектWord.Application.Selection.TypeText(Строка(ВыборкаДетальныеЗаписи.ОрганизацияИНН)); 
		Иначе
			ОбъектWord.Bookmarks("ОрганизацияИНН").Select();	
			ОбъектWord.Application.Selection.TypeText(Строка(ВыборкаДетальныеЗаписи.ОрганизацияФизическоеЛицоИНН));
		КонецЕсли;
	
		
		ОбъектWord.Bookmarks("КонтрагентНаименование").Select();	
		ОбъектWord.Application.Selection.TypeText(Строка(ВыборкаДетальныеЗаписи.КонтрагентНаименование));
		
		Если ВыборкаДетальныеЗаписи.КонтрагентВидКонтрагента = перечисления.Вид.ЮридическоеЛицо Тогда
			ОбъектWord.Bookmarks("КонтрагентИНН").Select();	
			ОбъектWord.Application.Selection.TypeText(Строка(ВыборкаДетальныеЗаписи.КонтрагентЮридическоеЛицоИНН));	 
		Иначе
			ОбъектWord.Bookmarks("КонтрагентИНН").Select();	
			ОбъектWord.Application.Selection.TypeText(Строка(ВыборкаДетальныеЗаписи.КонтрагентФизическоеЛицоИНН));	 
		КонецЕсли;
		
		
		ШаблонWord.Application.Visible = Истина;
		ШаблонWord.Activate();
		
		//ОбъектWord.Application.Quit();
	КонецЦикла;
	
КонецПроцедуры
